Revit 2026 API

# MarbleMarbleSize Property

---

The property labeled "Vein Spacing" from the "Marble" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MarbleSize { get; }
```
```vb
Public Shared ReadOnly Property MarbleSize As String
	Get
```
```cpp
public:
static property String^ MarbleSize {
	String^ get ();
}
```
```fsharp
static member MarbleSize : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 100".

#### Reference

Marble Class

Autodesk.Revit.DB.Visual Namespace